# Lab | Data Aggregation and Filtering

Objective: Use Python programming techniques to filter and order data subsets, group data by one or more variables, and use aggregation functions to obtain insights, and derive meaningful conclusions from the data.

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing first data cleaning, formatting, and structuring.

Start by reading the dataset, standardizing column names, dealing with null values and creating the month column. You can do so by using the functions you developed in previous labs, or by reading the clean dataset you saved in the last lab `data structuring and combining`.

Then, answer the following questions:

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

2. Analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign.

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

4. Find the median customer lifetime value by education level and gender.

5. Find the maximum, minimum, and average number of open complaints by state and policy type.

6. The marketing team wants to analyze the number of policies sold by state and month.

Present the data in a table where the months are arranged as columns and the states are arranged as rows.

7. Display a new DataFrame that contains the number of policies sold by month by state for the top 3 states with the highest number of policies sold.

*Hint:* 
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

8. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [1]:
# your code goes here

import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 26 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Unnamed: 0                     10910 non-null  int64
 1   Customer                       10910 non-null  object
 2   State                          10279 non-null  object
 3   Customer Lifetime Value        10910 non-null  float64
 4   Response                       10279 non-null  object
 5   Coverage                       10910 non-null  object
 6   Education                      10910 non-null  object
 7   Effective To Date              10910 non-null  object
 8   EmploymentStatus               10910 non-null  object
 9   Gender                         10910 non-null  object
 10  Income                         10910 non-null  int64
 11  Location Code                  10910 non-null  object
 12  Marital Status                 10910 non-null  object
 13  Monthly Premium Auto           10910 non-null  int64
 14  Months Since Last Claim        10277 non-null  float64
 15  Months Since Policy Inception  10910 non-null  int64
 16  Number of Open Complaints      10277 non-null  float64
 17  Number of Policies             10910 non-null  int64
 18  Policy Type                    10910 non-null  object
 19  Policy                         10910 non-null  object
 20  Renew Offer Type               10910 non-null  object
 21  Sales Channel                  10910 non-null  object
 22  Total Claim Amount             10910 non-null  float64
 23  Vehicle Class                  10288 non-null  object
 24  Vehicle Size                   10288 non-null  object
 25  Vehicle Type                   5428 non-null   object
dtypes: float64(4), int64(5), object(17)
memory usage: 2.2+ MB

In [2]:
from datetime import datetime

def rename_columns(df):
    new_col_names = [name.strip().lower().replace(' ', '_') for name in df.columns]
    new_col_names = ['state' if name == 'st' else name for name in new_col_names]
    df.columns = new_col_names

rename_columns(df)
df.drop(['unnamed:_0'], axis=1, inplace=True)
df['effective_to_date'] = pd.to_datetime(df['effective_to_date'], format='%m/%d/%y')
df['month'] = df['effective_to_date'].dt.strftime('%b')
df['year'] = df['effective_to_date'].dt.year

def replace_null_values(df, column, replacement):
    df[column].fillna(replacement, inplace=True)
    
for col in ['state', 'response', 'vehicle_class', 'vehicle_size', 'vehicle_type']:
    replace_null_values(df, col, 'n.a.')

for col in ['months_since_last_claim', 'number_of_open_complaints']:
    replace_null_values(df, col, -1)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 27 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   customer                       10910 non-null  object
 1   state                          10910 non-null  object
 2   customer_lifetime_value        10910 non-null  float64
 3   response                       10910 non-null  object
 4   coverage                       10910 non-null  object
 5   education                      10910 non-null  object
 6   effective_to_date              10910 non-null  datetime64[ns]
 7   employmentstatus               10910 non-null  object
 8   gender                         10910 non-null  object
 9   income                         10910 non-null  int64
 10  location_code                  10910 non-null  object
 11  marital_status                 10910 non-null  object
 12  monthly_premium_auto           10910 non-null  int64
 13  months_since_last_claim        10910 non-null  float64
 14  months_since_policy_inception  10910 non-null  int64
 15  number_of_open_complaints      10910 non-null  float64
 16  number_of_policies             10910 non-null  int64
 17  policy_type                    10910 non-null  object
 18  policy                         10910 non-null  object
 19  renew_offer_type               10910 non-null  object
 20  sales_channel                  10910 non-null  object
 21  total_claim_amount             10910 non-null  float64
 22  vehicle_class                  10910 non-null  object
 23  vehicle_size                   10910 non-null  object
 24  vehicle_type                   10910 non-null  object
 25  month                          10910 non-null  object
 26  year                           10910 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(5), object(17)
memory usage: 2.2+ MB

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign

In [3]:
filtered_df = df[(df['total_claim_amount'] > 1000) & (df['response'] == 'Yes')]
filtered_df.head()

,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,income,...,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month,year
189,OK31456,California,11009.130490,Yes,Premium,Bachelor,2011-01-24,Employed,F,51643,...,Corporate Auto,Corporate L3,Offer2,Agent,1358.400000,Luxury Car,Medsize,n.a.,Jan,2011
236,YJ16163,Oregon,11009.130490,Yes,Premium,Bachelor,2011-01-24,Employed,F,51643,...,Special Auto,Special L3,Offer2,Agent,1358.400000,Luxury Car,Medsize,A,Jan,2011
419,GW43195,Oregon,25807.063000,Yes,Extended,College,2011-02-13,Employed,F,71210,...,Personal Auto,Personal L2,Offer1,Branch,1027.200000,Luxury Car,Small,A,Feb,2011
442,IP94270,Arizona,13736.132500,Yes,Premium,Master,2011-02-13,Disabled,F,16181,...,Personal Auto,Personal L2,Offer1,Web,1261.319869,SUV,Medsize,A,Feb,2011
587,FJ28407,California,5619.689084,Yes,Premium,High School or Below,2011-01-26,Unemployed,M,0,...,Personal Auto,Personal L1,Offer2,Web,1027.000029,SUV,Medsize,A,Jan,2011

2. Analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign.

In [4]:
df[df['response'] == 'Yes'].groupby(['policy_type', 'gender'], as_index=False).agg({'total_claim_amount':'mean'}).round(2).rename(columns={'total_claim_amount': 'avg_total_claim'})

      policy_type gender  avg_total_claim
0  Corporate Auto      F           433.74
1  Corporate Auto      M           408.58
2   Personal Auto      F           452.97
3   Personal Auto      M           457.01
4    Special Auto      F           453.28
5    Special Auto      M           429.53

In [5]:
pd.pivot_table(data=df,
               index=['policy_type'],
               columns=['gender'],
               values=['total_claim_amount'],
               aggfunc='mean').round(2).rename(columns={'total_claim_amount': 'avg_total_claim'}).reset_index()

           policy_type avg_total_claim
gender                               F       M
0       Corporate Auto          397.80  462.22
1        Personal Auto          413.24  459.92
2         Special Auto          458.14  420.36

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [6]:
dff = df.groupby(['state']).agg({'customer':'count'}).reset_index().rename(columns={'customer':'total_customers'})
dff[dff['total_customers'] > 500]

        state  total_customers
0     Arizona             1937
1  California             3552
2      Nevada              993
3      Oregon             2909
4  Washington              888
5        n.a.              631

4. Find the median customer lifetime value by education level and gender.

In [14]:
# df.groupby(['education', 'gender'], as_index=False).agg({'customer_lifetime_value':'median'}).round(2).rename(columns={'customer_lifetime_value':'median_lifetime_value'})

pd.pivot_table(data=df,
              index=['education'],
              columns=['gender'],
              values=['customer_lifetime_value'],
              aggfunc='median').round(2).rename(columns={'customer_lifetime_value':'median_lifetime_value'})

              education gender  median_lifetime_value
0              Bachelor      F                5640.51
1              Bachelor      M                5548.03
2               College      F                5623.61
3               College      M                6005.85
4                Doctor      F                5332.46
5                Doctor      M                5577.67
6  High School or Below      F                6039.55
7  High School or Below      M                6286.73
8                Master      F                5729.86
9                Master      M                5579.10

5. Find the maximum, minimum, and average number of open complaints by state and policy type.

In [8]:
# because I used -1 as a dummy value to avoid deleting 
# records with null values for number_of_complaints
# I have to make sure I exclude -1 from the statistics calculation

df[df['number_of_open_complaints']>=0].groupby(['state', 'policy_type']).agg({'number_of_open_complaints':['min', 'max', 'mean']}).round(2)

                          number_of_open_complaints
                                                min  max  mean
state      policy_type
Arizona    Corporate Auto                       0.0  5.0  0.36
           Personal Auto                        0.0  5.0  0.39
           Special Auto                         0.0  3.0  0.25
California Corporate Auto                       0.0  4.0  0.31
           Personal Auto                        0.0  5.0  0.40
           Special Auto                         0.0  5.0  0.45
Nevada     Corporate Auto                       0.0  5.0  0.46
           Personal Auto                        0.0  5.0  0.41
           Special Auto                         0.0  5.0  0.60
Oregon     Corporate Auto                       0.0  4.0  0.34
           Personal Auto                        0.0  5.0  0.37
           Special Auto                         0.0  5.0  0.37
Washington Corporate Auto                       0.0  5.0  0.51
           Personal Auto                        0.0  5.0  0.38
           Special Auto                         0.0  4.0  0.65
n.a.       Corporate Auto                       0.0  3.0  0.27
           Personal Auto                        0.0  5.0  0.43
           Special Auto                         0.0  5.0  0.46

6. The marketing team wants to analyze the number of policies sold by state and month.
    Present the data in a table where the months are arranged as columns and the states are arranged as rows.

In [9]:
pd.pivot_table(data=df,
              index=['state'],
              columns=['month'],
              values=['policy'],
              aggfunc='count').rename(columns={'policy':'#_policies_sold'})

           #_policies_sold
month                  Feb   Jan
state
Arizona                929  1008
California            1634  1918
Nevada                 442   551
Oregon                1344  1565
Washington             425   463
n.a.                   318   313

7. Display a new DataFrame that contains the number of policies sold by month by state for the top 3 states with the highest number of policies sold.

Hint: To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.
Next, you will select the top 3 states with the highest number of policies sold.
Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.

In [11]:
df.columns

Index(['customer', 'state', 'customer_lifetime_value', 'response', 'coverage',
       'education', 'effective_to_date', 'employmentstatus', 'gender',
       'income', 'location_code', 'marital_status', 'monthly_premium_auto',
       'months_since_last_claim', 'months_since_policy_inception',
       'number_of_open_complaints', 'number_of_policies', 'policy_type',
       'policy', 'renew_offer_type', 'sales_channel', 'total_claim_amount',
       'vehicle_class', 'vehicle_size', 'vehicle_type', 'month', 'year'],
      dtype='object')

In [15]:
df.groupby(['state', 'month']).agg({'policy':'count'}).reset_index().sort_values(['policy'], ascending=False)

         state month  policy
3   California   Jan    1918
2   California   Feb    1634
7       Oregon   Jan    1565
6       Oregon   Feb    1344
1      Arizona   Jan    1008
0      Arizona   Feb     929
5       Nevada   Jan     551
9   Washington   Jan     463
4       Nevada   Feb     442
8   Washington   Feb     425
10        n.a.   Feb     318
11        n.a.   Jan     313

In [54]:
max_states = df.query('state in (\'California\', \'Oregon\', \'Arizona\')')

pivot = pd.pivot_table(data=max_states,
              index='state',
              columns='month',
              values='policy',
              aggfunc='count').reset_index().rename(columns={'Feb':'Feb_tot_#_policies', 'Jan':'Jan_tot_#_policies'})

gby = max_states.groupby(['state', 'month']).agg({'policy':'count'}).reset_index().rename(columns={'policy':'tot_#_policies'})

In [55]:
pivot

month       state  Feb_tot_#_policies  Jan_tot_#_policies
0         Arizona                 929                1008
1      California                1634                1918
2          Oregon                1344                1565

In [56]:
gby

        state month  tot_#_policies
0     Arizona   Feb             929
1     Arizona   Jan            1008
2  California   Feb            1634
3  California   Jan            1918
4      Oregon   Feb            1344
5      Oregon   Jan            1565

8. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

In [79]:
df.head()

,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,income,...,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month,year
0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,48029,...,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,n.a.,Feb,2011
1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,0,...,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,n.a.,Jan,2011
2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,22139,...,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,Feb,2011
3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,49078,...,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,Jan,2011
4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,23675,...,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,n.a.,Jan,2011

In [77]:
pd.melt(df[df.response=='Yes'], id_vars=['sales_channel'], value_vars='response', value_name='positive_response').groupby(['sales_channel']).agg({'positive_response':'count'})

               positive_response
sales_channel
Agent                        742
Branch                       326
Call Center                  221
Web                          177

In [71]:
pd.pivot_table(data=df,
              index='sales_channel',
              columns='response',
              values='policy',
              aggfunc='count')#['Yes']

response         No  Yes  n.a.
sales_channel
Agent          3148  742   231
Branch         2539  326   157
Call Center    1792  221   128
Web            1334  177   115

In [78]:
df[df['response']=='Yes'].groupby(['sales_channel','response']).agg({'policy':'count'}).reset_index()

  sales_channel response  policy
0         Agent      Yes     742
1        Branch      Yes     326
2   Call Center      Yes     221
3           Web      Yes     177